Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
        if (bmi_init_in_progress) {
            int bmi_result = bmi088_init_step(&g_imu, startup_now);
            if (bmi_result != 0) {
                bmi_init_in_progress = 0U;
            }
        }

        for (int i = 0; i < 4; ++i) {
            if (!device_health_is_fresh(&servo_feedback[i].health,
                                        startup_now,
                                        SAFETY_SERVO_MAX_AGE_MS)) {
                startup_servos_online = 0U;
            }
        }
        startup_inputs.now_ms = startup_now;
        startup_inputs.imu_initialized = g_imu.initialized;
        startup_inputs.gyro_calibrated = g_safety_state.is_gyro_calibrated;
        startup_inputs.wheel_l_online = device_health_is_fresh(&left_feedback.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.wheel_r_online = device_health_is_fresh(&right_feedback.health,
                                                               startup_now,
                                                               SAFETY_WHEEL_MAX_AGE_MS);
        startup_inputs.servos_online = startup_servos_online;
        startup_inputs.actuator_configured = actuator_configured;
        startup_outputs = startup_manager_step(&startup_manager, &startup_inputs);

        if (startup_outputs.request_imu_init && !g_imu.initialized && !bmi_init_in_progress) {
            bmi088_begin_init(&g_imu, &hi2c1, startup_now);
            bmi_init_in_progress = 1U;
        }

        if (startup_outputs.request_actuator_discovery && !actuator_configured) {
            int discovery_result = -1;
            if (actuator_discovery_step == 0U) {
                discovery_result = ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_left,
                                                       DDSM_MODE_CURRENT, startup_now);
            } else if (actuator_discovery_step == 1U) {
                discovery_result = ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left,
                                                         0U, startup_now);
            } else if (actuator_discovery_step == 2U) {
                discovery_result = ddsm_bus_queue_mode(&g_ddsm_bus, &g_ddsm_right,
                                                       DDSM_MODE_CURRENT, startup_now);
            } else if (actuator_discovery_step == 3U) {
                discovery_result = ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right,
                                                         0U, startup_now);
            } else if (actuator_discovery_step < 8U) {
                discovery_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(actuator_discovery_step - 3U), 0U);
            }
            if (actuator_discovery_step < 8U && discovery_result == 0) {
                ++actuator_discovery_step;
            }
            actuator_configured = (uint8_t)(actuator_discovery_step >= 8U);
        }

        if (startup_outputs.enable_actuators && !servos_enabled &&
            (int32_t)(startup_now - next_actuator_enable_ms) >= 0) {
            int enable_result = -1;
            if (servo_enable_step < 4U) {
#if SERVO_ZERO_CALIBRATION_MODE
                enable_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(servo_enable_step + 1U), 0U);
#else
                enable_result = st3215_bus_queue_torque(
                    &g_st3215_bus, (uint8_t)(servo_enable_step + 1U), 1U);
#endif
            }
            if (servo_enable_step < 4U && enable_result == 0) {
                ++servo_enable_step;
            }
            next_actuator_enable_ms = startup_now + 5U;
            servos_enabled = (uint8_t)(servo_enable_step >= 4U);
        }

        /* Wheel power is a separately armed safety domain.  Discovery and
         * zero-current polling run while disabled; enabling requires an
         * authenticated, fresh Pi mode request and is revoked on link loss. */
        if (wheel_authorized && wheel_enable_mask != 0x03U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((wheel_enable_mask & 0x01U) == 0U) {
                if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left, 1U, startup_now) == 0) {
                    wheel_enable_mask |= 0x01U;
                }
            } else if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right, 1U, startup_now) == 0) {
                wheel_enable_mask |= 0x02U;
            }
        } else if (!wheel_authorized && wheel_enable_mask != 0U && ddsm_bus_is_idle(&g_ddsm_bus)) {
            if ((wheel_enable_mask & 0x01U) != 0U) {
                if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_left, 0U, startup_now) == 0) {
                    wheel_enable_mask &= (uint8_t)~0x01U;
                }
            } else if (ddsm_bus_queue_enable(&g_ddsm_bus, &g_ddsm_right, 0U, startup_now) == 0) {
                wheel_enable_mask &= (uint8_t)~0x02U;
            }
        }

        if (startup_outputs.fault_requested) {
            safety_state_trigger_fault(FAULT_INIT);
        }

        /* Reaching this point proves the scheduler is alive even before DRDY. */
        HAL_IWDG_Refresh(&hiwdg);

        /* Soft real-time scheduler aligned to system ticks (1ms resolution) */
        if (g_system_ticks != last_tick) {
            /* Use the actual elapsed time; blocking bus I/O can skip ticks */
            uint32_t dticks = g_system_ticks - last_tick;
            last_tick = g_system_ticks;
            float fusion_dt = (float)dticks * 0.001f;

            /* DRDY can arrive while the BMI088 register sequence is still in
             * progress.  Do not read or calibrate from an uninitialized IMU. */
            if (!g_imu.initialized) {
                continue;
            }

            /* 1. Read IMU sensors (safe to do here in the main loop background) */
            bmi088_read_accel(&g_imu);
            bmi088_read_gyro(&g_imu);

            /* Refresh chip temperature at low rate (~10 Hz) for safety/telemetry */
            if (++temp_refresh_counter >= 100) {
                temp_refresh_counter = 0;
                bmi088_read_temp(&g_imu);
            }

            float gx = g_imu.gyro[0];
            float gy = g_imu.gyro[1];
            float gz = g_imu.gyro[2];

            /* 2. Run sensor fusion update */
            if (g_safety_state.is_gyro_calibrated) {
                gx -= g_safety_state.gyro_calib_offset[0];
                gy -= g_safety_state.gyro_calib_offset[1];
                gz -= g_safety_state.gyro_calib_offset[2];

                mahony_update(&g_mahony,
                              g_imu.accel[0], g_imu.accel[1], g_imu.accel[2],
                              gx, gy, gz, fusion_dt);
            } else {
                safety_state_gyro_calib_update(gx, gy, gz, HAL_GetTick());
            }
            g_body_gyro[0] = gx;
            g_body_gyro[1] = gy;
            g_body_gyro[2] = gz;

            /* Balance-relevant tilt & rate mapped to the physical IMU mounting.
             * Pitch rate uses the bias-corrected gyro (offset is 0 until calibrated). */
            float body_pitch = ATT_PITCH(&g_mahony);
            float body_pitch_rate = ATT_PITCH_RATE_SIGN *
                (g_imu.gyro[ATT_PITCH_RATE_IDX] - g_safety_state.gyro_calib_offset[ATT_PITCH_RATE_IDX]);

            /* 3. Run the 250 Hz motor deadline and lower-rate telemetry slots. */
            uint8_t slot = last_tick % 4;
            uint8_t control_due = control_deadline_pending;
            uint8_t right_due = (uint8_t)((int32_t)(last_tick - next_right_tick) >= 0);
            if (control_due) control_deadline_pending = 0U;

            /* Safety state machine update (at 250 Hz, inside slot scheduler) */
            if (control_due && startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
                float max_temp = g_imu.temperature;
                for (int i = 0; i < 4; i++) {
                    if (servo_feedback[i].temperature_c > max_temp) {
                        max_temp = servo_feedback[i].temperature_c;
                    }
                }
                SafetyInputs_t safety_inputs;
                SafetyDecision_t safety_decision;
                uint32_t safety_now = HAL_GetTick();
                uint8_t servos_fresh = 1U;
                for (int i = 0; i < 4; ++i) {
                    if (!device_health_is_fresh(&servo_feedback[i].health,
                                                safety_now,
                                                SAFETY_SERVO_MAX_AGE_MS)) {
                        servos_fresh = 0U;
                    }
                }
                safety_inputs.now_ms = safety_now;
                safety_inputs.pitch_rad = body_pitch;
                safety_inputs.pitch_rate_rads = body_pitch_rate;
                safety_inputs.max_temp_c = max_temp;
                safety_inputs.gyro_calibrated = g_safety_state.is_gyro_calibrated;
                safety_inputs.startup_ready = servos_enabled;
                safety_inputs.imu_fresh = device_health_is_fresh(&g_imu.health,
                                                                 safety_now,
                                                                 SAFETY_IMU_MAX_AGE_MS);
                safety_inputs.wheel_l_fresh = device_health_is_fresh(&left_feedback.health,
                                                                     safety_now,
                                                                     SAFETY_WHEEL_MAX_AGE_MS);
                safety_inputs.wheel_r_fresh = device_health_is_fresh(&right_feedback.health,
                                                                     safety_now,
                                                                     SAFETY_WHEEL_MAX_AGE_MS);
                safety_inputs.servos_fresh = servos_fresh;
                safety_inputs.link_compatible = pi_link_is_compatible();
                safety_inputs.heartbeat_fresh = pi_link_heartbeat_fresh();
                safety_inputs.action_fresh = pi_link_action_fresh();
                safety_inputs.requested_mode = g_pi_cmd_heartbeat.mode_request;
                safety_decision = safety_state_update(&safety_inputs);
                if (safety_decision.enter_hold) {
                    pi_link_enter_hold();
                } else if (safety_decision.clear_action) {
                    pi_link_clear_action();
                }
            }

            /* --- Slot 0: Compute LQR (once/cycle), command & poll Left DDSM --- */
            if (control_due && startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
                if (runtime_outputs.wheel_intent_allowed) {
                    /* Snapshot Pi commands atomically (updated in USART6 ISR) */
                    Pi_Command_Heartbeat_t hb;
                    Pi_Command_Action_t act;
                    Pi_Command_Snapshot(&hb, &act);
                    /* Average wheel velocity in body frame -> forward speed ẋ.
                     * All command and residual fields now use the shared P0 contract. */
                    float wheel_vel_l = WHEEL_DIR_L * left_feedback.velocity_rads;
                    float wheel_vel_r = WHEEL_DIR_R * right_feedback.velocity_rads;
                    float yaw_rate = gz;
                    if (!pi_link_is_compatible() || !pi_link_heartbeat_fresh()) {
                        /* Enter a fresh local hold reference immediately; do not
                         * jerk-limit a stale command back to zero from its old
                         * moving reference. */
                        lqr_reset(&g_lqr, g_lqr.x_est, g_mahony.yaw);
                    }

