Weilv-D/kuafu/stm32_firmware/Core/Src/main.c
                    /* Run LQR once per 250 Hz cycle; cache both wheel commands. */
                    lqr_update(&g_lqr,
                               body_pitch,
                                body_pitch_rate,
                                wheel_vel_l,
                                wheel_vel_r,
                                g_mahony.yaw,
                                yaw_rate,
                                hb.target_velocity,
                                hb.target_yaw_rate,
                                runtime_outputs.residual_allowed
                                    ? act.delta_torque_common : 0.0f,
                                runtime_outputs.residual_allowed
                                    ? act.delta_torque_yaw : 0.0f,
                                &g_ctrl_tau_l,
                                &g_ctrl_tau_r);

                    (void)ddsm_bus_queue_torque(&g_ddsm_bus, &g_ddsm_left,
                                                WHEEL_DIR_L * g_ctrl_tau_l,
                                                last_tick);
                } else {
                    /* Safe stop wheels if in FAULT or INIT */
                    g_ctrl_tau_l = 0.0f;
                    g_ctrl_tau_r = 0.0f;
                    (void)ddsm_bus_queue_query(&g_ddsm_bus, &g_ddsm_left, last_tick);
                }
            }

            /* The right motor has an independent staggered deadline. This keeps
             * the two blocking half-duplex transactions from routinely sharing
             * one 4 ms control slot. */
            if (right_due && startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY) {
                next_right_tick = last_tick + 4U;
                if (runtime_outputs.wheel_intent_allowed) {
                    (void)ddsm_bus_queue_torque(&g_ddsm_bus, &g_ddsm_right,
                                                WHEEL_DIR_R * g_ctrl_tau_r,
                                                last_tick);
                } else {
                    (void)ddsm_bus_queue_query(&g_ddsm_bus, &g_ddsm_right, last_tick);
                }
            }

            /* --- Slot 2: Queue telemetry data to Raspberry Pi 5 --- */
            if (slot == 2) {
                pi_link_send_imu(&huart6, 
                                 g_mahony.roll, 
                                 g_mahony.pitch, 
                                 g_mahony.yaw, 
                                  g_body_gyro[0],
                                  g_body_gyro[1],
                                  g_body_gyro[2]);

                /* Report joint feedback in the shared sim/body frame so it is
                 * symmetric with the command contract (mirror + zero applied). */
                float servo_pos[4], servo_vel[4], servo_cur[4];
                for (int i = 0; i < 4; i++) {
                    servo_pos[i] = servo_tick_to_angle(servo_feedback[i].position_tick, (uint8_t)i);
                    servo_vel[i] = (float)servo_direction((uint8_t)i) * servo_feedback[i].velocity_rads;
                    servo_cur[i] = servo_feedback[i].current_a;
                }

                /* Single-turn wheel angle (raw); velocity/torque mapped to body frame */
                float wheel_l_pos = left_feedback.position_rad;
                float wheel_r_pos = right_feedback.position_rad;

                pi_link_send_joints(&huart6,
                                    wheel_l_pos, WHEEL_DIR_L * left_feedback.velocity_rads, WHEEL_DIR_L * left_feedback.torque,
                                    wheel_r_pos, WHEEL_DIR_R * right_feedback.velocity_rads, WHEEL_DIR_R * right_feedback.torque,
                                    servo_pos, servo_vel, servo_cur);
            }

            /* --- Slot 3: Diagnostic packages & main controller logic --- */
            else if (slot == 3) {
                /* Battery sensing is not populated on this hardware.  Zero is
                 * the protocol sentinel for unavailable, not an undervoltage. */
                pi_link_send_diag(&huart6, 0U, (uint8_t)g_imu.temperature,
                                  safety_state_legacy_fault_mask());

                if (++health_telemetry_divider >= 25U) {
                    Pi_HealthTelemetry_t health;
                    int i;
                    uint32_t health_now = HAL_GetTick();
                    health_telemetry_divider = 0U;
                    health.fault_mask = g_safety_state.fault_mask;
                    health.mode = (uint8_t)g_safety_state.current_mode;
                    health.reset_cause = g_reset_cause;
                    health.imu_age_ms = Device_Age_Ms(&g_imu.health, health_now);
                    health.wheel_l_age_ms = Device_Age_Ms(&left_feedback.health, health_now);
                    health.wheel_r_age_ms = Device_Age_Ms(&right_feedback.health, health_now);
                    health.imu_errors = Device_Error_Count(&g_imu.health);
                    health.wheel_l_errors = Device_Error_Count(&left_feedback.health);
                    health.wheel_r_errors = Device_Error_Count(&right_feedback.health);
                    for (i = 0; i < 4; ++i) {
                        health.servo_age_ms[i] = Device_Age_Ms(&servo_feedback[i].health,
                                                               health_now);
                        health.servo_errors[i] = Device_Error_Count(&servo_feedback[i].health);
                    }
                    (void)pi_link_send_health(&huart6, &health);
                }

                if (g_safety_state.current_mode == STATE_FAULT) {
                    pi_link_send_fault(&huart6, safety_state_legacy_fault_mask());
                }
            }
        }

        /* --- 50 Hz Background Loop: ST3215 Servo Control --- */
        uint32_t current_time = HAL_GetTick();
        if (startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY && servo_deadline_pending) {
            servo_deadline_pending = 0U;

            uint8_t ids[4] = {SERVO_LF_ID, SERVO_RF_ID, SERVO_LB_ID, SERVO_RB_ID};

#if SERVO_ZERO_CALIBRATION_MODE
            /* Position commands are intentionally suppressed. System setup
             * has already disabled torque; feedback polling below still runs. */
            (void)ids;
#else
            if (g_safety_state.current_mode == STATE_ACTIVE &&
                runtime_outputs.servo_intent_allowed) {
                /* Pi supplies bounded workspace residuals.  Project them through
                 * the same dwell-relative (Qx,D0) five-bar IK as the simulator. */
                Pi_Command_Heartbeat_t hb;
                Pi_Command_Action_t act;
                Pi_Command_Snapshot(&hb, &act);
                int16_t pos_ticks[4];
                uint16_t speed_ticks[4] = {2000, 2000, 2000, 2000};
                uint8_t accels[4] = {50, 50, 50, 50};
                float action_scale = runtime_outputs.residual_allowed ? 1.0f : 0.0f;
                float d0_max = (fabsf(hb.target_velocity) > D0_GATE_V_THRESH ||
                                fabsf(hb.target_yaw_rate) > D0_GATE_W_THRESH)
                                   ? D0_GATE_MAX_HIGH * 0.001f : KIN_MAX_LEG_D0;
                float roll_term_mm = -(KUAFU_ROLL_KP * g_mahony.roll +
                                       KUAFU_ROLL_KD * g_body_gyro[0]);
                float d0_l = hb.target_leg_d0 + 0.001f * roll_term_mm / 2.0f +
                             0.001f * D0_RESIDUAL_SCALE_MM * action_scale * act.d0_l;
                float d0_r = hb.target_leg_d0 - 0.001f * roll_term_mm / 2.0f +
                             0.001f * D0_RESIDUAL_SCALE_MM * action_scale * act.d0_r;
                if (d0_l < KIN_MIN_LEG_D0) d0_l = KIN_MIN_LEG_D0;
                if (d0_l > d0_max) d0_l = d0_max;
                if (d0_r < KIN_MIN_LEG_D0) d0_r = KIN_MIN_LEG_D0;
                if (d0_r > d0_max) d0_r = d0_max;
                float qA_l, qB_l, qA_r, qB_r;
                if (kinematics_solve_ik_xy(QX_RESIDUAL_SCALE_MM * 0.001f * action_scale * act.qx_l, d0_l, &qA_l, &qB_l) == 0 &&
                    kinematics_solve_ik_xy(QX_RESIDUAL_SCALE_MM * 0.001f * action_scale * act.qx_r, d0_r, &qA_r, &qB_r) == 0) {
                    pos_ticks[0] = servo_angle_to_tick(qA_l, 0);
                    pos_ticks[1] = servo_angle_to_tick(qA_r, 1);
                    pos_ticks[2] = servo_angle_to_tick(qB_l, 2);
                    pos_ticks[3] = servo_angle_to_tick(qB_r, 3);
                    (void)st3215_bus_queue_sync_write(&g_st3215_bus, ids, 4U,
                                                      pos_ticks, speed_ticks, accels);
                }
            }
            else if ((g_safety_state.current_mode == STATE_STAND ||
                      g_safety_state.current_mode == STATE_CLIMB) &&
                     runtime_outputs.servo_intent_allowed) {
                /* Standing/Climbing virtual height mode */
                Pi_Command_Heartbeat_t hb;
                Pi_Command_Action_t act;
                Pi_Command_Snapshot(&hb, &act);
                (void)act;

                float q_hip_A = 0.0f; /* A chain, pivot x=-c (LF, RF) */
                float q_hip_B = 0.0f; /* B chain, pivot x=+c (LB, RB) */

                /* Compute inverse kinematics mapping for target height */
                if (kinematics_solve_ik(hb.target_leg_d0, &q_hip_A, &q_hip_B) == 0) {
                    int16_t pos_ticks[4];
                    uint16_t speed_ticks[4] = {1500, 1500, 1500, 1500};
                    uint8_t accels[4] = {30, 30, 30, 30};

                    pos_ticks[0] = servo_angle_to_tick(q_hip_A, 0); /* LF (A chain) */
                    pos_ticks[1] = servo_angle_to_tick(q_hip_A, 1); /* RF (A chain) */
                    pos_ticks[2] = servo_angle_to_tick(q_hip_B, 2); /* LB (B chain) */
                    pos_ticks[3] = servo_angle_to_tick(q_hip_B, 3); /* RB (B chain) */

                    (void)st3215_bus_queue_sync_write(&g_st3215_bus, ids, 4U,
                                                      pos_ticks, speed_ticks, accels);
                }
            }
            else if (g_safety_state.current_mode == STATE_FAULT) {
                /* Lockdown: disable servo torque once to allow gravity lock.
                 * Sending the disable every 50 Hz cycle floods the full-duplex
                 * bus with echo bytes that desync subsequent read queries, so a
                 * one-shot flag is used instead of repeated transmission. */
                if (fault_servo_disable_idx < 4U &&
                    st3215_bus_queue_torque(&g_st3215_bus,
                                            ids[fault_servo_disable_idx], 0U) == 0) {
                    ++fault_servo_disable_idx;
                }
            }
#endif
        }

        /* Poll every servo round-robin, including offline devices, so a valid
         * frame can restore health after line noise or a temporary disconnect. */
        current_time = HAL_GetTick();
        if (startup_manager.phase >= STARTUP_ACTUATOR_DISCOVERY &&
            current_time - last_servo_query_ms >= 5U &&
            st3215_bus_queue_read(&g_st3215_bus,
                                  &g_servos[active_servo_query_idx],
                                  g_safety_state.current_mode == STATE_INIT
                                      ? 0U : SERVO_FAIL_LIMIT,
                                  current_time) == 0) {
            last_servo_query_ms = current_time;
            active_servo_query_idx = (active_servo_query_idx + 1) % 4;
        }
    }
}

/**
 * @brief EXTI1 callback: triggered at 1kHz by Gyro DRDY pin (PB1).
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == IMU_INT_PIN) {
        g_system_ticks++;
    }
}

/**
 * @brief Atomically snapshots the Pi command state (updated in the USART6 ISR)
 *        to avoid torn multi-byte reads in the main loop.
 */
static void Pi_Command_Snapshot(Pi_Command_Heartbeat_t *hb, Pi_Command_Action_t *act) {
    HAL_NVIC_DisableIRQ(USART6_IRQn);
    *hb = g_pi_cmd_heartbeat;
    *act = g_pi_cmd_action;
    HAL_NVIC_EnableIRQ(USART6_IRQn);
}

/**
 * @brief System Clock Configuration to 168MHz (from 8MHz HSE)
 */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 8;
    RCC_OscInitStruct.PLL.PLLN = 336;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2; /* SYSCLK = 168MHz */
    RCC_OscInitStruct.PLL.PLLQ = 7;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4; /* APB1 = 42MHz */
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2; /* APB2 = 84MHz */
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
        Error_Handler();
    }
}

